In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
for each in os.listdir():
    print(each)

.ipynb_checkpoints
book rental datasets
book rental datasets.zip
Book_Recommendations-Copy1.ipynb
BX-Book-Ratings.csv
BX-Books.csv
BX-Users.csv
Recommend.csv
Untitled-Copy1.ipynb
Untitled.ipynb

In [3]:
rating = "BX-Book-Ratings.csv"
book = "BX-Books.csv"
users = "BX-Users.csv"

In [4]:
r = pd.read_csv(rating,encoding="latin-1")
b = pd.read_csv(book,encoding="latin-1")
u = pd.read_csv(users,encoding="latin-1")

C:\Users\david\AppData\Local\Temp\ipykernel_8564\2495360632.py:2: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  b = pd.read_csv(book,encoding="latin-1")
C:\Users\david\AppData\Local\Temp\ipykernel_8564\2495360632.py:3: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  u = pd.read_csv(users,encoding="latin-1")

In [5]:
r

         user_id        isbn  rating
0         276725  034545104X       0
1         276726   155061224       5
2         276727   446520802       0
3         276729  052165615X       3
4         276729   521795028       6
...          ...         ...     ...
1048570   250764   451410777       0
1048571   250764   452264464       8
1048572   250764  048623715X       0
1048573   250764   486256588       0
1048574   250764   515069434       0

[1048575 rows x 3 columns]

In [6]:
u

       user_id                            Location   Age
0            1                  nyc, new york, usa   NaN
1            2           stockton, california, usa  18.0
2            3     moscow, yukon territory, russia   NaN
3            4           porto, v.n.gaia, portugal  17.0
4            5  farnborough, hants, united kingdom   NaN
...        ...                                 ...   ...
278854  278854               portland, oregon, usa   NaN
278855  278855  tacoma, washington, united kingdom  50.0
278856  278856           brampton, ontario, canada   NaN
278857  278857           knoxville, tennessee, usa   NaN
278858  278858                dublin, n/a, ireland   NaN

[278859 rows x 3 columns]

In [7]:
# 1. Read the books dataset and explore it
b

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company
...,...,...,...,...,...
271374,440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm)
271375,525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books
271376,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco
271377,192126040,Republic (World's Classics),Plato,1996,Oxford University Press
271378,767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages

In [8]:
b.shape

(271379, 5)

In [9]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271379 entries, 0 to 271378
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   isbn                 271379 non-null  object
 1   book_title           271379 non-null  object
 2   book_author          271378 non-null  object
 3   year_of_publication  271379 non-null  object
 4   publisher            271377 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB

In [10]:
b.describe().T

                      count  unique              top   freq
isbn                 271379  271379        195153448      1
book_title           271379  242150   Selected Poems     27
book_author          271378  102042  Agatha Christie    632
year_of_publication  271379     202             2002  17145
publisher            271377   16823        Harlequin   7535

In [11]:
# 2. Clean up NaN values

In [12]:
u.isnull().sum()

user_id          0
Location         1
Age         110763
dtype: int64

In [13]:
# Droping the nan Values.
u = u.dropna(axis=0)

In [14]:
u.isnull().sum() # Now there is no nan values.

user_id     0
Location    0
Age         0
dtype: int64

In [15]:
b.isnull().sum()

isbn                   0
book_title             0
book_author            1
year_of_publication    0
publisher              2
dtype: int64

In [16]:
r.isnull().sum()

user_id    0
isbn       0
rating     0
dtype: int64

In [17]:
# 3. Read the data where ratings are given by users

In [18]:
r.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [19]:
r.describe()

            user_id        rating
count  1.048575e+06  1.048575e+06
mean   1.285089e+05  2.879907e+00
std    7.421876e+04  3.857870e+00
min    2.000000e+00  0.000000e+00
25%    6.339400e+04  0.000000e+00
50%    1.288350e+05  0.000000e+00
75%    1.927790e+05  7.000000e+00
max    2.788540e+05  1.000000e+01

In [20]:
# merging the two data set books and rating.

In [21]:
df = pd.merge(r,b,on='isbn')

In [22]:
df

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
1,2313,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
2,6543,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
3,8680,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
4,10314,034545104X,9,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
...,...,...,...,...,...,...,...
941143,250764,440106575,0,HIDDEN FIRES,JANETTE RADCLIFFE,1978,Dell
941144,250764,451157516,0,"Cheyenne (Fortunes West, No 2)",A.R. Riefe,1988,New Amer Library (Mm)
941145,250764,048623715X,0,Glamorous Movie Stars of the Thirties: Paper D...,Tom Tierney,1982,Dover Publications
941146,250764,486256588,0,Schiaparelli Fashion Review: Paper Dolls in Fu...,Tom Tierney,1988,Dover Publications
941147,250764,515069434,0,Lady Laughing Eyes (To Have and to Hold),Lee Damon,1984,Jove Books

In [23]:
# 4. Take a quick look at the number of unique users and books.

In [24]:
a=df['user_id'].nunique()
a

83644

In [25]:
df['isbn'].nunique()

257832

In [26]:
# 5. Convert the user_id variable to numeric numbers in the correct order.

In [27]:
# convert user_id into the numeric number.
list_userid = df.user_id.unique()
print("length of isbn list: ", len(list_userid))

length of isbn list:  83644

In [28]:
def userid_numeric(user_id):
    itemindex = np.where(list_userid==user_id)
    return itemindex[0][0]

In [29]:
# do the same with ISBN and it into the numeric number.
list_isbn = df.isbn.unique()
print("length of isbn list: ", len(list_isbn))

length of isbn list:  257832

In [30]:
def isbn_numeric_id(isbn):
    itemindex = np.where(list_isbn==isbn)
    return itemindex[0][0]

In [31]:
# 6. Convert both user_id and ISBN to the ordered list, i.e., from 0...n-1

In [ ]:
df['user_id_order'] = df['user_id'].apply(userid_numeric)

In [ ]:
df['isbn_order'] = df['isbn'].apply(isbn_numeric_id)

In [ ]:
df.head()

In [ ]:
# 7. Re-index the columns to build a matrix.

In [ ]:
ordered_col = ['user_id_order', 'isbn_order', 'rating', 'book_title', 'book_author', 'year_of_publication','publisher',
               'user_id', 'isbn']
df = df.reindex(columns = ordered_col)

In [ ]:
df

In [ ]:
# 8. Split your data into two sets (training and testing).

In [ ]:
from sklearn.model_selection import train_test_split
train_data, test_data = train_test_split(df, test_size=0.25)

In [ ]:
# 9. Make predictions based on user and item variables.

In [ ]:
train_matrix = np.zeros((n_users, n_books))
for line in train.itertuples():
    train_matrix[line[1]-1, line[2]-1] = line[3]
    
test_matrix = np.zeros((n_users, n_books))
for line in test.itertuples():
    test_matrix[line[1]-1, line[2]-1] = line[3]

In [ ]:
from sklearn.metrics.pairwise import pairwise_distances 
user_correlation = pairwise_distances(train_matrix, metric= 'cosine')
item_correlation = pairwise_distances(train_matrix.T, metric= 'cosine')

In [ ]:
user_correlation

In [ ]:
def predict(ratings,correlation, type= 'user'):
    if type == 'user':
        mean_user_rating = ratings.mean(axis=1)
        rating_diff = (ratings - mean_user_rating[:,np.newaxis]) 
        pred = mean_user_rating[:, np.newaxis] + correlation.dot(rating_diff) / np.array([np.abs(correlation).sum(axis=1)]).T
    elif type == 'item':
        pred = ratings.dot(correlation) / np.array([np.abs(correlation).sum(axis=1)])
        
    return pred

In [ ]:
user_prediction = predict(train_matrix, user_correlation, type = 'user')
item_prediction = predict(train_matrix, item_correlation, type = 'item')

In [ ]:
item_prediction.shape

In [ ]:
# 10. Use RMSE to evaluate the predictions.

In [ ]:
from sklearn.metrics import mean_squared_error
from math import sqrt
def rmse(prediction, actual):
    prediction = prediction[actual.nonzero()].flatten() 
    actual = actual[actual.nonzero()].flatten()
    return sqrt(mean_squared_error(prediction, actual))

In [ ]:
print('User-based CF RMSE: ' + str(rmse(user_prediction, test_matrix)))
print('Item-based CF RMSE: ' + str(rmse(item_prediction, test_matrix)))